<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of TechSmith Snagit and imports into Munki.

To use this recipe or subsequent child recipes, a license key must be provided in an override via the SNAGIT_KEY input, which will license Snagit during the installation.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.kernsb.munki.TechSmithSnagit</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/TechSmith</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Snagit</string>
				<string>SnagitAppleScriptExecutor</string>
				<string>SnagitHelper</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Use images and videos to show people exactly what you're seeing. Snagit gives you an easy way to quickly provide better feedback, create clear documentation, and change the way you work together.</string>
			<key>display_name</key>
			<string>TechSmith Snagit</string>
			<key>minimum_os_version</key>
			<string>10.9</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
			<string>%PREINSTALL_SCRIPT%</string>
			<key>postinstall_script</key>
			<string>%POSTINSTALL_SCRIPT%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.kernsb.download.TechSmithSnagit</string>
	<key>Process</key>
	<array>
        <dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%pathname%</string>
			<key>repo_subdirectory</key>
			<string>%MUNKI_REPO_SUBDIR%</string>
		</dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
        </dict>
	</array>
</dict>
</plist>
