<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Snagit disk image and builds a package.  Adapted from rtrouton's Firefox pkg recipe.

The installer package includes a preinstall script that will check for an existing "Snagit.app" in /Applications and remove it if found.

To use this recipe or subsequent child recipes, a license key must be provided in an override via the SNAGIT_KEY input, which will license Snagit during the installation.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.kernsb.pkg.TechSmithSnagit</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.kernsb.download.TechSmithSnagit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Users</key>
					<string>0775</string>
					<key>Users/Shared</key>
					<string>0777</string>
					<key>Users/Shared/TechSmith</key>
					<string>0777</string>
					<key>Users/Shared/TechSmith/Snagit</key>
					<string>0777</string>
					<key>private</key>
					<string>0775</string>
					<key>private/tmp</key>
					<string>0775</string>
					<key>private/tmp/snagit</key>
					<string>0775</string>
					<key>private/tmp/snagit/scripts</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%app_name%</string>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>%PREINSTALL_SCRIPT%</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%pkgroot%/private/tmp/snagit/scripts/preinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>%SNAGIT_KEY%</string>
				<key>file_mode</key>
				<string>0777</string>
				<key>file_path</key>
				<string>%pkgroot%/Users/Shared/TechSmith/Snagit/LicenseKey</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>%bundleid%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>scripts</key>
					<string>%pkgroot%/private/tmp/snagit/scripts</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%pkgroot%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
