<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest TechSmith Camtasia disk image.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.kernsb.download.TechSmithCamtasia</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TechSmithCamtasia</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>product_name</key>
                <string>camtasia</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg.kernsb.download.TechSmithSnagit/TechSmithURLProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Camtasia 2019.app</string>
                <key>requirements</key>
                <string>identifier "com.techsmith.camtasia2019" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TQL462TU8"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
