<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Apple Hewlett-Packard Printer Drivers disk image.</string>
	<key>Identifier</key>
	<string>edu.purdue.ag.download.HewlettPackardPrinterDrivers</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>HewlettPackardPrinterDrivers</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://support.apple.com/kb/DL907</string>
				<key>re_pattern</key>
				<string>(?:download_link.setAttribute\('href',')(.*\.dmg)(?:'\);)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://support.apple.com%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
