<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Apple HP Printer Drivers for OS X and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.kernsb.munki.AppleHPDrivers</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>HewlettPackardPrinterDrivers</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Apple</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Official Apple HP Print Driver package.</string>
			<key>display_name</key>
			<string>Hewlett-Packard Printer Software</string>
			<key>minimum_os_version</key>
			<string>10.5.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.kernsb.download.AppleHPDrivers</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://support.apple.com/kb/DL907</string>
				<key>result_output_var_name</key>
				<string>detected_ver</string>
				<key>re_pattern</key>
				<string>(?:&lt;h1 id=&quot;main-title&quot;>HP Printer Drivers v)(.*)(?: for OS X&lt;/h1&gt;)</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%detected_ver%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
